Revit 2027 API
SpatialFieldManager.IsResultSchemaNameUnique Method
 Verify the uniqueness of the name among all registered result schemas.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsResultSchemaNameUnique(
	string name,
	int resultIndexToSkip
)
Public Function IsResultSchemaNameUnique (
	name As String,
	resultIndexToSkip As Integer
) As Boolean
public:
bool IsResultSchemaNameUnique(
	String^ name,
	int resultIndexToSkip
)
member IsResultSchemaNameUnique :
        name : string *
        resultIndexToSkip : int -> bool
Parameters
name String
 Name to verify uniqueness of.
resultIndexToSkip Int32
 Index of result (e.g. to be replaced) which names should not count for uniqueness; negative number means nothing is excluded from comparison.
Return Value
Boolean
 True if name is unique, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
SpatialFieldManager Class
Autodesk.Revit.DB.Analysis Namespace